In [55]:
import pandas as pd

In [56]:
clientes = pd.read_csv("../data/clientes.csv",sep=";")
clientes.head()

,idCliente,flEmail,flTwitch,flYouTube,flBlueSky,flInstagram,qtdePontos,DtCriacao,DtAtualizacao
0,000dc0f6-e4f2-4a42-b8cd-b586ed1c709a,0,1,0,0,0,2,2025-11-13 12:03:56.114,2025-12-13 11:45:37.364
1,000ff655-fa9f-4baa-a108-47f581ec52a1,0,0,0,0,0,25086,2024-02-01 00:00:00.000,2025-09-26 13:28:37.697
2,001749bd-37b5-4b1e-8111-f9fbba90f530,0,0,0,0,0,50,2024-02-01 00:00:00.000,2024-02-01 00:00:00.000
3,0019bb9e-26d4-4ebf-8727-fc911ea28a92,0,0,0,0,0,2,2024-02-01 00:00:00.000,2024-02-01 00:00:00.000
4,0028dda2-334f-40bb-9582-475fb6719471,0,1,0,0,0,0,2025-10-29 02:08:18.367,2025-10-29 02:08:18.367

In [57]:
clientes["qtdePontos"].sort_values(ascending=True)

2511        0
975         0
973         0
1792        0
3979        0
        ...
2450    16246
4146    21078
850     21294
474     24013
1       25086
Name: qtdePontos, Length: 4859, dtype: int64

In [58]:
max_ponto = clientes["qtdePontos"].max()
filtro = clientes["qtdePontos"] == max_ponto
clientes[filtro]

,idCliente,flEmail,flTwitch,flYouTube,flBlueSky,flInstagram,qtdePontos,DtCriacao,DtAtualizacao
1,000ff655-fa9f-4baa-a108-47f581ec52a1,0,0,0,0,0,25086,2024-02-01 00:00:00.000,2025-09-26 13:28:37.697

In [59]:
top_5 = (clientes.sort_values(by="qtdePontos", ascending=False)
        .head(5)["idCliente"]
)

In [60]:
top_5

1       000ff655-fa9f-4baa-a108-47f581ec52a1
474     163022e8-12b8-486f-8604-57d8fa0ed7e1
850     2a9d4ba3-4c58-47f9-8dc4-6f9cb50be1b1
4146    d7f7eb75-4f0b-4d15-960d-8efe5ca7dd7e
2450    803debdb-8136-4cb5-af29-dcd8db36bf2c
Name: idCliente, dtype: object

##### Exemplo com empate

In [ ]:
brinquedo = pd.DataFrame(
    {
        "nome": ["pedro", "tiago", "joao", "mateus"],
        "idade": [32, 45, 35, 42],
        "salario": [2345, 4533, 3245, 4533],
    }
)
brinquedo

     nome  idade  salario
0   pedro     32     2345
1   tiago     45     4533
2    joao     35     3245
3  mateus     42     4533

In [63]:
brinquedo.sort_values(by=["salario", "idade"], ascending=[False, True])

     nome  idade  salario
3  mateus     42     4533
1   tiago     45     4533
2    joao     35     3245
0   pedro     32     2345